/* ============================================================
* 자바스크립트 코딩테스트 연습문제
* 섹션 1
* 12. 대문자로 통일
* ============================================================ */

/*
#===========================================================================================================================#
    대문자와 소문자가 같이 존재하는 문자열을 입력받아 대문자로 모두 통일하여 문자열을 출력하는 프로그램을 작성하세요
#===========================================================================================================================#
*/

/*
#===========================================================================================================================#
    입력 설명
    - 첫 줄에 문자열이 입력된다. 문자열의 길이는 100을 넘지 않습니다.
    
    출력 설명
    - 첫 줄에 대문자로 통일된 문자열이 출력된다.

    입력 예제 1
    ItisTimeToStudy

    출력 예제 1
    ITISTIMETOSTUDY
#===========================================================================================================================#
*/

function solution(s){
    // 방법 1
    // var answer = "";
    // answer = s.toUpperCase();
    // return answer;

    /*
    #===========================================================================================================================#
        1. answer를 빈 문자열로 초기화한다.
        2. 파라미터로 받은 s를 toUpperCase()로 대문자로 변경한다.
        3. answer를 return 한다.
    #===========================================================================================================================#
    */

    // 방법 2
    // let answer = "";
    // for(let x of s) {
    //     if(x === x.toLowerCase()) {
    //         answer += x.toUpperCase();
    //     } else {
    //         answer += x;
    //     }
    // }

    // return answer

    /*
    #===========================================================================================================================#
        1. answer를 빈 문자열로 초기화한다.
        2. 파라미터로 받은 문자열을 for of 반복문을 돌린다.
        3. 만약 x가 소문자면 answer에 x를 대문자로 변환하여 넣고 대문자면 answer에 그대로 넣는다.
        4. answer를 return 한다.
    #===========================================================================================================================#
    */

    // 방법 3
    let answer = "";
    for(let x of s) {
        let num = x.charCodeAt();
        if(num >= 97 && num <= 122) {
            answer += String.fromCharCode(num - 32);
        } else {
            answer += x;
        }
    }

    return answer;

    /*
    #===========================================================================================================================#
        1. answer를 빈 문자열로 초기화한다.
        2. 파라미터로 받은 문자열을 for of 반복문을 돌린다.
        3. num에 파라미터로 받은 문자열 x의 아스키코드를 넣는다. (charCodeAt);
        4. 만약 해당 문자열 x의 아스키코드가 97이상 122이하(소문자 아스키코드)라면 answer에 해당 문자열의 아스키코드를 32를 뺀 뒤에 fromCharCode로 해당 아스키코드의 문자열을 집어넣는다.
        5. 만약 해당하지않는다면 대문자이므로 그대로 answer에 넣는다.
        6. answer를 return 한다.
    #===========================================================================================================================#
    */
}

let str="ItisTimeToStudy";
console.log(solution(str));