/* ============================================================
* 자바스크립트 코딩테스트 연습문제
* 섹션 1
* 13. 대소문자 변환
* ============================================================ */

/*
#===========================================================================================================================#
    대문자와 소문자가 같이 존재하는 문자열을 입력받아 대문자는 소문자로 소문자는 대문자로 변환하여 출력하는 프로그램을 작성하세요
#===========================================================================================================================#
*/

/*
#===========================================================================================================================#
    입력 설명
    - 첫 줄에 문자열이 입력된다. 문자열의 길이는 100을 넘지 않습니다.
    
    출력 설명
    - 첫 줄에 대문자는 소문자로, 소문자는 대문자로 변환된 문자열을 출력합니다.

    입력 예제 1
    StuDY

    출력 예제 1
    sTUdy
#===========================================================================================================================#
*/

function solution(s){
    var answer = "";
    for(let x of s) {
        if(x === x.toUpperCase()) {
            answer += x.toLowerCase();
        } else {
            answer += x.toUpperCase();
        }
    }
    return answer;

    /*
    #===========================================================================================================================#
        1. answer를 빈 문자열로 초기화한다.
        2. for of 반복문으로 전달받은 문자열을 반복문을 돌린다.
        3. 만약에 해당 문자열 x가 대문자이면 answer에 toLowerCase로 소문자로 변환 후 answer에 추가한다.
        4. 만약에 해당 문자열 x가 소문자이면 answer에 toUpperCase로 대문자로 변환 후 answer에 추가한다.
        5. answer를 return 한다.
    #===========================================================================================================================#
    */
}

console.log(solution("StuDY"));